Revit 2027 API
MultiReferenceAnnotationType.GroupTagHeads Property
 Controls if parameter values for the annotation's references will be reported in one grouped tag head or if every reference will get its own tag head.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool GroupTagHeads { get; set; }
Public Property GroupTagHeads As Boolean
	Get
	Set
public:
property bool GroupTagHeads {
	bool get ();
	void set (bool value);
}
member GroupTagHeads : bool with get, set
Property Value
Boolean
 When false, each reference will get one tag head. When true, if all references report the same parameter values, a single tag head will be created.
See Also
Reference
MultiReferenceAnnotationType Class
Autodesk.Revit.DB Namespace